0_org/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    tankTop
    {
        type            fixedValue;
        value           uniform 293;
	//type            zeroGradient;
    }
	
    ".*Wall"
    {
        type            zeroGradient;
    }

    pipeRight
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
