0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    tankTop
    {
//    This velocity inlet/outlet boundary condition is applied to pressure
//    boundaries where the pressure is specified.  A zero-gradient condition is
//    applied for outflow (as defined by the flux); for inflow, the velocity is
//    obtained from the patch-face normal component of the internal-cell value.
//    The tangential patch velocity can be optionally specified.
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	
    ".*Wall"
    {
        type            noSlip;
    }

    pipeRight
    {
        type            noSlip;
    }
}

// ************************************************************************* //
