0_org/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    tankTop
    {
        type            outletInlet;
	outletValue     uniform 0;
        value           uniform 0;//only air enters/exits through the top boundary.
    }

    ".*Wall"
    {
        type            zeroGradient;
    }
	// dead end of the pipe
    pipeRight
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
