0_org/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat; //turblence thermal diffusivity
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [ 1 -1 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
	tankTop
	{
	type	calculated;
	value	uniform 0;
	}
	
    ".*Wall"
	{
        type            compressible::alphatWallFunction;
        value           uniform 0;
	}
	
    pipeRight
	{
        type            compressible::alphatWallFunction;
        value           uniform 0;
	}
}

// ************************************************************************* //
