0_org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00513;

boundaryField
{
    tankTop
    {
	type	           fixedValue;
	value              $internalField;
	//value	           uniform 0;
	//type             zeroGradient;
    }
    ".*Wall"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    pipeRight
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
