0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0275;

boundaryField
{
    tankTop
    {
	    type	        fixedValue;
		value           $internalField;
	    //value	        uniform 0;
	    //type            zeroGradient;
    }
    ".*Wall"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    pipeRight
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
