0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0133;

boundaryField
{
    tankTop
    {
	type	    fixedValue;
	value	    $internalField;
	//value	    uniform 0;
	//type            zeroGradient;
    }
    ".*Wall"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    pipeRight
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
