0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0075; //calculated value

boundaryField
{
    /*
    tankTop
    {
        type            outletInlet;
        outletValue     uniform 0;
        value           uniform 0;
    }
    */
    tankTop
    {
	type	           fixedValue;
	value              $internalField;
	//value	           uniform 0;
	//type             zeroGradient;
    }
    ".*Wall"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    pipeRight
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
