0_org/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    tankTop
    {
	// compressible subsonic:
        type            totalPressure;
	p0              uniform 2e5;//
    }
	
    ".*Wall"
    {
        type            calculated;
        value           $internalField;
    }
	
    pipeRight
    {
        type            calculated;
        value           $internalField;
    }
}
}

// ************************************************************************* //
