system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha)     Gauss vanLeer;
    div(phirb,alpha)   Gauss linear;

    div(rhoPhi,U)      Gauss upwind;
    div(rhoPhi,T)      Gauss upwind;
    div(rhoPhi,K)      Gauss upwind;
	
    div(phi,p)         Gauss upwind;
    div(phi,k)         Gauss upwind;
    //div(phi,epsilon)   Gauss upwind; 
    div(phi,omega)   Gauss upwind; 
    div(phi,nuTilda)   Gauss upwind;

    div(rhoPhi,k)        Gauss upwind;
    //div(rhoPhi,epsilon)  Gauss upwind;
    div(rhoPhi,omega)  Gauss upwind;
	
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

// for kOmegaSST model
wallDist
{
	method meshWave;
}
// ************************************************************************* //
