system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;

// Fields to be probed. runTime modifiable!
fields
(
    p
    p_rgh
    U
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (1.55 0 0)
    //(0.24 0.12 0.01)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
